; ModuleID = 'dos2unix.c'
source_filename = "dos2unix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.CFlag = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@stdout = external global ptr, align 8
@.str = private unnamed_addr constant [215 x i8] c"Copyright (C) 2009-%d Erwin Waterlander\0ACopyright (C) 1998      Christian Wurll (Version 3.1)\0ACopyright (C) 1998      Bernd Johannes Wuebben (Version 3.0)\0ACopyright (C) 1994-1995 Benjamin Lin\0AAll rights reserved.\0A\0A\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"%s: \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Binary symbol 0x00%02X found at line %u\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [32 x i8] c"Added line break to last line.\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [37 x i8] c"Converted %u out of %u line breaks.\0A\00", align 1, !dbg !22

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "dos2unix.c", directory: "/datasets/dos2unix-7.5.2", checksumkind: CSK_MD5, checksum: "417b0dd75ef40c9a0f817583b776dfa5")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1720, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 215)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 5)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 41)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 32)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 37)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "D2UAsciiTable", scope: !29, file: !117, line: 34, type: !118, isLocal: true, isDefinition: true)
!29 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "Ubuntu clang version 15.0.7", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !30, globals: !60, splitDebugInlining: false, nameTableKind: None)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFlag", file: !34, line: 253, baseType: !35)
!34 = !DIFile(filename: "./common.h", directory: "/datasets/dos2unix-7.5.2", checksumkind: CSK_MD5, checksum: "26bc2c6b37c09e44e591f80b29ca9daf")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 230, size: 672, elements: !36)
!36 = !{!37, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !59}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NewFile", scope: !35, file: !34, line: 232, baseType: !38, size: 32)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !35, file: !34, line: 233, baseType: !38, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "KeepDate", scope: !35, file: !34, line: 234, baseType: !38, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ConvMode", scope: !35, file: !34, line: 235, baseType: !38, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "FromToMode", scope: !35, file: !34, line: 236, baseType: !38, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "NewLine", scope: !35, file: !34, line: 237, baseType: !38, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Force", scope: !35, file: !34, line: 238, baseType: !38, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "AllowChown", scope: !35, file: !34, line: 239, baseType: !38, size: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Follow", scope: !35, file: !34, line: 240, baseType: !38, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !35, file: !34, line: 241, baseType: !38, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_mode", scope: !35, file: !34, line: 242, baseType: !38, size: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "to_stdout", scope: !35, file: !34, line: 243, baseType: !38, size: 32, offset: 352)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !35, file: !34, line: 244, baseType: !38, size: 32, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bomtype", scope: !35, file: !34, line: 245, baseType: !38, size: 32, offset: 416)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "add_bom", scope: !35, file: !34, line: 246, baseType: !38, size: 32, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "keep_bom", scope: !35, file: !34, line: 247, baseType: !38, size: 32, offset: 480)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "keep_utf16", scope: !35, file: !34, line: 248, baseType: !38, size: 32, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "file_info", scope: !35, file: !34, line: 249, baseType: !38, size: 32, offset: 544)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "locale_target", scope: !35, file: !34, line: 250, baseType: !38, size: 32, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "line_nr", scope: !35, file: !34, line: 251, baseType: !58, size: 32, offset: 608)
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "add_eol", scope: !35, file: !34, line: 252, baseType: !38, size: 32, offset: 640)
!60 = !{!0, !7, !12, !17, !22, !61, !66, !71, !76, !81, !86, !91, !96, !101, !106, !108, !110, !27, !115, !121, !123, !125, !127, !129, !131}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 21)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 39)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 569, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 9)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 19)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 18)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 70)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 608, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 10)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 609, type: !9, isLocal: true, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 620, type: !73, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 620, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 13)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "D2U7BitTable", scope: !29, file: !117, line: 58, type: !118, isLocal: true, isDefinition: true)
!117 = !DIFile(filename: "./dos2unix.h", directory: "/datasets/dos2unix-7.5.2", checksumkind: CSK_MD5, checksum: "e246759484e3e4f5e348ba4412f7c13c")
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8192, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 256)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "D2UIso437Table", scope: !29, file: !117, line: 82, type: !118, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "D2UIso850Table", scope: !29, file: !117, line: 105, type: !118, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "D2UIso860Table", scope: !29, file: !117, line: 128, type: !118, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "D2UIso863Table", scope: !29, file: !117, line: 151, type: !118, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "D2UIso865Table", scope: !29, file: !117, line: 174, type: !118, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "D2UIso1252Table", scope: !29, file: !117, line: 197, type: !118, isLocal: true, isDefinition: true)
!133 = !{i32 7, !"Dwarf Version", i32 5}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{i32 1, !"wchar_size", i32 4}
!136 = !{i32 7, !"PIC Level", i32 2}
!137 = !{i32 7, !"PIE Level", i32 2}
!138 = !{i32 7, !"uwtable", i32 2}
!139 = !{i32 7, !"frame-pointer", i32 2}
!140 = !{!"Ubuntu clang version 15.0.7"}
!141 = distinct !DISubprogram(name: "PrintLicense", scope: !2, file: !2, line: 77, type: !142, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !{}
!145 = !DILocation(line: 79, column: 20, scope: !141)
!146 = !DILocation(line: 79, column: 27, scope: !141)
!147 = !DILocation(line: 79, column: 3, scope: !141)
!148 = !DILocation(line: 85, column: 3, scope: !141)
!149 = !DILocation(line: 86, column: 1, scope: !141)
!150 = distinct !DISubprogram(name: "StripDelimiterW", scope: !2, file: !2, line: 89, type: !151, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !144)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !155, !155, !32, !153, !212, !213}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !154, line: 20, baseType: !58)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !157, line: 7, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !159, line: 49, size: 1728, elements: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "7a6d4a00a37ee6b9a40cd04bd01f5d00")
!160 = !{!161, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !177, !179, !180, !181, !185, !187, !189, !190, !193, !195, !198, !201, !202, !203, !207, !208}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !158, file: !159, line: 51, baseType: !38, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !158, file: !159, line: 54, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !158, file: !159, line: 55, baseType: !163, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !158, file: !159, line: 56, baseType: !163, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !158, file: !159, line: 57, baseType: !163, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !158, file: !159, line: 58, baseType: !163, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !158, file: !159, line: 59, baseType: !163, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !158, file: !159, line: 60, baseType: !163, size: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !158, file: !159, line: 61, baseType: !163, size: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !158, file: !159, line: 64, baseType: !163, size: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !158, file: !159, line: 65, baseType: !163, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !158, file: !159, line: 66, baseType: !163, size: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !158, file: !159, line: 68, baseType: !175, size: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !159, line: 36, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !158, file: !159, line: 70, baseType: !178, size: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !158, file: !159, line: 72, baseType: !38, size: 32, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !158, file: !159, line: 73, baseType: !38, size: 32, offset: 928)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !158, file: !159, line: 74, baseType: !182, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !183, line: 152, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!184 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !158, file: !159, line: 77, baseType: !186, size: 16, offset: 1024)
!186 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !158, file: !159, line: 78, baseType: !188, size: 8, offset: 1040)
!188 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !158, file: !159, line: 79, baseType: !98, size: 8, offset: 1048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !158, file: !159, line: 81, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !159, line: 43, baseType: null)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !158, file: !159, line: 89, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !183, line: 153, baseType: !184)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !158, file: !159, line: 91, baseType: !196, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !159, line: 37, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !158, file: !159, line: 92, baseType: !199, size: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !159, line: 38, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !158, file: !159, line: 93, baseType: !178, size: 64, offset: 1344)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !158, file: !159, line: 94, baseType: !31, size: 64, offset: 1408)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !158, file: !159, line: 95, baseType: !204, size: 64, offset: 1472)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !205, line: 46, baseType: !206)
!205 = !DIFile(filename: "/usr/lib/llvm-15/lib/clang/15.0.7/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "b76978376d35d5cd171876ac58ac1256")
!206 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !158, file: !159, line: 96, baseType: !38, size: 32, offset: 1536)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !158, file: !159, line: 98, baseType: !209, size: 160, offset: 1568)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 20)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!215 = !DILocalVariable(name: "ipInF", arg: 1, scope: !150, file: !2, line: 89, type: !155)
!216 = !DILocation(line: 89, column: 30, scope: !150)
!217 = !DILocalVariable(name: "ipOutF", arg: 2, scope: !150, file: !2, line: 89, type: !155)
!218 = !DILocation(line: 89, column: 43, scope: !150)
!219 = !DILocalVariable(name: "ipFlag", arg: 3, scope: !150, file: !2, line: 89, type: !32)
!220 = !DILocation(line: 89, column: 58, scope: !150)
!221 = !DILocalVariable(name: "CurChar", arg: 4, scope: !150, file: !2, line: 89, type: !153)
!222 = !DILocation(line: 89, column: 73, scope: !150)
!223 = !DILocalVariable(name: "converted", arg: 5, scope: !150, file: !2, line: 89, type: !212)
!224 = !DILocation(line: 89, column: 96, scope: !150)
!225 = !DILocalVariable(name: "progname", arg: 6, scope: !150, file: !2, line: 89, type: !213)
!226 = !DILocation(line: 89, column: 119, scope: !150)
!227 = !DILocalVariable(name: "TempNextChar", scope: !150, file: !2, line: 91, type: !153)
!228 = !DILocation(line: 91, column: 10, scope: !150)
!229 = !DILocation(line: 95, column: 34, scope: !230)
!230 = distinct !DILexicalBlock(scope: !150, file: !2, line: 95, column: 8)
!231 = !DILocation(line: 95, column: 41, scope: !230)
!232 = !DILocation(line: 95, column: 49, scope: !230)
!233 = !DILocation(line: 95, column: 24, scope: !230)
!234 = !DILocation(line: 95, column: 22, scope: !230)
!235 = !DILocation(line: 95, column: 59, scope: !230)
!236 = !DILocation(line: 95, column: 8, scope: !150)
!237 = !DILocation(line: 96, column: 22, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !2, line: 96, column: 9)
!239 = distinct !DILexicalBlock(scope: !230, file: !2, line: 95, column: 68)
!240 = !DILocation(line: 96, column: 36, scope: !238)
!241 = !DILocation(line: 96, column: 43, scope: !238)
!242 = !DILocation(line: 96, column: 51, scope: !238)
!243 = !DILocation(line: 96, column: 9, scope: !238)
!244 = !DILocation(line: 96, column: 60, scope: !238)
!245 = !DILocation(line: 96, column: 9, scope: !239)
!246 = !DILocation(line: 97, column: 24, scope: !247)
!247 = distinct !DILexicalBlock(scope: !238, file: !2, line: 96, column: 69)
!248 = !DILocation(line: 97, column: 31, scope: !247)
!249 = !DILocation(line: 97, column: 9, scope: !247)
!250 = !DILocation(line: 98, column: 9, scope: !247)
!251 = !DILocation(line: 100, column: 10, scope: !252)
!252 = distinct !DILexicalBlock(scope: !239, file: !2, line: 100, column: 10)
!253 = !DILocation(line: 100, column: 23, scope: !252)
!254 = !DILocation(line: 100, column: 10, scope: !239)
!255 = !DILocation(line: 101, column: 21, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !2, line: 101, column: 11)
!257 = distinct !DILexicalBlock(scope: !252, file: !2, line: 100, column: 33)
!258 = !DILocation(line: 101, column: 30, scope: !256)
!259 = !DILocation(line: 101, column: 38, scope: !256)
!260 = !DILocation(line: 101, column: 46, scope: !256)
!261 = !DILocation(line: 101, column: 11, scope: !256)
!262 = !DILocation(line: 101, column: 56, scope: !256)
!263 = !DILocation(line: 101, column: 11, scope: !257)
!264 = !DILocation(line: 102, column: 27, scope: !265)
!265 = distinct !DILexicalBlock(scope: !256, file: !2, line: 101, column: 65)
!266 = !DILocation(line: 102, column: 34, scope: !265)
!267 = !DILocation(line: 102, column: 11, scope: !265)
!268 = !DILocation(line: 103, column: 11, scope: !265)
!269 = !DILocation(line: 105, column: 5, scope: !257)
!270 = !DILocation(line: 106, column: 9, scope: !271)
